[ML Zoomcamp 1.9 - Introduction to Pandas](https://www.youtube.com/watch?v=0j3XK5PsnxA)

In [1]:
import pandas as pd

# DataFrames

In [3]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000, 13000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 20000, 88000],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 5000, 95000],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle Style', 'MSRP', 'price'
]

In [6]:
df = pd.DataFrame(data, columns=columns)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle Style,MSRP,price
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,13000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,20000,88000
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,5000,95000

In [8]:
df.head(n=2)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle Style,MSRP,price
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,13000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,20000,88000

In [50]:
df.to_dict(orient='records')

[{'Make': 'Nissan',
  'Model': 'Stanza',
  'Year': 1991,
  'Engine HP': 138.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle Style': 'sedan',
  'MSRP': 2000,
  'price': 13000},
 {'Make': 'Hyundai',
  'Model': 'Sonata',
  'Year': 2017,
  'Engine HP': nan,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle Style': 'Sedan',
  'MSRP': 20000,
  'price': 88000},
 {'Make': 'Lotus',
  'Model': 'Elise',
  'Year': 2010,
  'Engine HP': 218.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle Style': 'convertible',
  'MSRP': 5000,
  'price': 95000}]

# Series

Each DataFrame consist of multiple Series

In [9]:
df.Make

0     Nissan
1    Hyundai
2      Lotus
Name: Make, dtype: object

In [10]:
df[['Make', 'Model']]

      Make   Model
0   Nissan  Stanza
1  Hyundai  Sonata
2    Lotus   Elise

In [16]:
df['id'] = [1, 2, 3]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle Style,MSRP,price,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,13000,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,20000,88000,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,5000,95000,3

In [17]:
del df['id']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle Style,MSRP,price
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,13000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,20000,88000
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,5000,95000

# Index

In [18]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [20]:
df.Make.index

RangeIndex(start=0, stop=3, step=1)

In [24]:
df.loc[[1, 2]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle Style,MSRP,price
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,20000,88000
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,5000,95000

In [27]:
df.index = ['a', 'b', 'c']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle Style,MSRP,price
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,13000
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,20000,88000
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,5000,95000

In [28]:
df.loc[['a', 'b']]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle Style,MSRP,price
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,13000
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,20000,88000

In [31]:
df = df.reset_index(drop=True)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle Style,MSRP,price
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,13000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,20000,88000
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,5000,95000

# Element-wise operations

In [33]:
df['Engine HP'] * 2

0    276.0
1      NaN
2    436.0
Name: Engine HP, dtype: float64

In [34]:
df['Engine HP'] >= 100

0     True
1    False
2     True
Name: Engine HP, dtype: bool

# String operations

In [35]:
df['Vehicle Style']

0          sedan
1          Sedan
2    convertible
Name: Vehicle Style, dtype: object

In [36]:
'STR'.lower()

'str'

In [37]:
df['Vehicle Style'].str.capitalize()

0          Sedan
1          Sedan
2    Convertible
Name: Vehicle Style, dtype: object

In [39]:
df['Vehicle Style'].str.replace(' ', '_').str.lower()

0          sedan
1          sedan
2    convertible
Name: Vehicle Style, dtype: object

# Summarizing operations

In [40]:
df.MSRP.max()

np.int64(20000)

In [41]:
df.MSRP.describe()

count        3.000000
mean      9000.000000
std       9643.650761
min       2000.000000
25%       3500.000000
50%       5000.000000
75%      12500.000000
max      20000.000000
Name: MSRP, dtype: float64

In [42]:
df.describe().round(2)

          Year  Engine HP  Engine Cylinders      MSRP     price
count     3.00       2.00               3.0      3.00      3.00
mean   2006.00     178.00               4.0   9000.00  65333.33
std      13.45      56.57               0.0   9643.65  45456.94
min    1991.00     138.00               4.0   2000.00  13000.00
25%    2000.50     158.00               4.0   3500.00  50500.00
50%    2010.00     178.00               4.0   5000.00  88000.00
75%    2013.50     198.00               4.0  12500.00  91500.00
max    2017.00     218.00               4.0  20000.00  95000.00

In [43]:
df.Make.nunique()

3

In [44]:
df.nunique()

Make                 3
Model                3
Year                 3
Engine HP            2
Engine Cylinders     1
Transmission Type    2
Vehicle Style        3
MSRP                 3
price                3
dtype: int64

# Missing values

In [47]:
df.isnull()

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle Style,MSRP,price
0,False,False,False,False,False,False,False,False,False
1,False,False,False,True,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False

In [48]:
df.isnull().sum()

Make                 0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle Style        0
MSRP                 0
price                0
dtype: int64

# Grouping

In [ ]:
df.groupby('Transmission Type').MSRP.min()

Transmission Type
AUTOMATIC    20000
MANUAL        2000
Name: MSRP, dtype: int64